#### Terraform Plan Results 📖

| Step | Status |
|------|--------|
| Format | ❌ |
| Init | ✅ |
| Validate | ✅ |
| Plan | ✅ 📝 Changes detected |

<details><summary>Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_branding.tenant will be created
  + resource "auth0_branding" "tenant" {
      + favicon_url = (known after apply)
      + id          = (known after apply)
      + logo_url    = "https://ciam.example.com/logo.png"

      + colors {
          + page_background = "#ffffff"
          + primary         = "#0057b8"
        }

      + font {
          + url = "https://fonts.googleapis.com/css2?family=Roboto:wght@400;500;700&display=swap"
        }
    }

  # auth0_client.sample_app will be created
  + resource "auth0_client" "sample_app" {
      + allowed_logout_urls                 = [
          + "https://localhost:3000",
          + "https://dev.example.com",
        ]
      + app_type                            = "spa"
      + callbacks                           = [
          + "https://localhost:3000/callback",
          + "https://dev.example.com/callback",
        ]
      + client_id                           = (known after apply)
      + cross_origin_auth                   = true
      + custom_login_page_on                = (known after apply)
      + description                         = "Sample application deployed via Terraform"
      + grant_types                         = [
          + "authorization_code",
          + "refresh_token",
        ]
      + id                                  = (known after apply)
      + is_first_party                      = (known after apply)
      + is_token_endpoint_ip_header_trusted = (known after apply)
      + name                                = "Sample App"
      + oidc_backchannel_logout_urls        = (known after apply)
      + oidc_conformant                     = true
      + signing_keys                        = (sensitive value)
      + sso_disabled                        = false
      + web_origins                         = [
          + "https://localhost:3000",
          + "https://dev.example.com",
        ]

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 3600
          + secret_encoded      = (known after apply)
        }

      + refresh_token {
          + expiration_type              = "expiring"
          + idle_token_lifetime          = (known after apply)
          + infinite_idle_token_lifetime = (known after apply)
          + infinite_token_lifetime      = (known after apply)
          + leeway                       = (known after apply)
          + rotation_type                = "rotating"
          + token_lifetime               = 2592000
        }
    }

  # auth0_connection.database will be created
  + resource "auth0_connection" "database" {
      + display_name         = (known after apply)
      + id                   = (known after apply)
      + is_domain_connection = (known after apply)
      + name                 = "CUstom-Username-Password-Authentication"
      + realms               = (known after apply)
      + strategy             = "auth0"

      + options {
          + allowed_audiences        = (known after apply)
          + authorization_endpoint   = (known after apply)
          + brute_force_protection   = true
          + domain_aliases           = (known after apply)
          + ips                      = (known after apply)
          + issuer                   = (known after apply)
          + jwks_uri                 = (known after apply)
          + map_user_id_to_id        = (known after apply)
          + non_persistent_attrs     = (known after apply)
          + password_policy          = "good"
          + scopes                   = (known after apply)
          + set_user_root_attributes = (known after apply)
          + sign_in_endpoint         = (known after apply)
          + sign_out_endpoint        = (known after apply)
          + signing_cert             = (known after apply)
          + strategy_version         = (known after apply)
          + token_endpoint           = (known after apply)
          + userinfo_endpoint        = (known after apply)

          + password_complexity_options {
              + min_length = 12
            }

          + password_history {
              + enable = true
              + size   = 5
            }

          + password_no_personal_info {
              + enable = true
            }
        }
    }

  # auth0_connection_clients.database_clients will be created
  + resource "auth0_connection_clients" "database_clients" {
      + connection_id   = (known after apply)
      + enabled_clients = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + strategy        = (known after apply)
    }

  # auth0_guardian.mfa will be created
  + resource "auth0_guardian" "mfa" {
      + email         = false
      + id            = (known after apply)
      + otp           = true
      + policy        = "all-applications"
      + recovery_code = false

      + phone {
          + enabled       = false
          + message_types = [
              + "sms",
            ]
          + provider      = "auth0"
        }

      + webauthn_platform {
          + enabled                  = true
          + override_relying_party   = (known after apply)
          + relying_party_identifier = (known after apply)
        }

      + webauthn_roaming {
          + enabled                  = true
          + override_relying_party   = (known after apply)
          + relying_party_identifier = (known after apply)
          + user_verification        = (known after apply)
        }
    }

  # auth0_prompt.login will be created
  + resource "auth0_prompt" "login" {
      + id                             = (known after apply)
      + identifier_first               = true
      + universal_login_experience     = "new"
      + webauthn_platform_first_factor = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_type            = "spa"
  + client_id           = (known after apply)
  + client_name         = "Sample App"
  + database_connection = {
      + id   = (known after apply)
      + name = "CUstom-Username-Password-Authentication"
    }
  + mfa_enabled         = {
      + otp    = true
      + policy = "all-applications"
    }
  + tenant_branding     = {
      + colors   = [
          + {
              + page_background = "#ffffff"
              + primary         = "#0057b8"
            },
        ]
      + logo_url = "https://ciam.example.com/logo.png"
    }

```

</details>

*Environment: `dev` | Triggered by: @VooraUdayBhaskar*